### Subject
Using the *titanic.csv* file with passengers dataset, specifically fields *Survived, Pclass, Sex, Age, Fare*, predict the survival rate based on specified features.

In [1]:
import pandas as pd
import math
from sklearn import tree
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder

In [2]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df = df[['Survived','Pclass','Sex','Age','Fare']]
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
inputs = df.drop('Survived',axis='columns')
target = df['Survived']

In [5]:
le = LabelEncoder()
inputs['Sex'] = le.fit_transform(inputs['Sex'])
inputs.head(10)

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500
5       3    1   NaN   8.4583
6       1    1  54.0  51.8625
7       3    1   2.0  21.0750
8       3    0  27.0  11.1333
9       2    0  14.0  30.0708

In [6]:
inputs['Age'] = inputs['Age'].fillna(math.floor(inputs['Age'].mean()))
inputs.head(10)

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500
5       3    1  29.0   8.4583
6       1    1  54.0  51.8625
7       3    1   2.0  21.0750
8       3    0  27.0  11.1333
9       2    0  14.0  30.0708

In [7]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [8]:
model = tree.DecisionTreeClassifier()
model.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [9]:
model.score(X_test,y_test)

0.8324022346368715